IDEA Open Model
Plane Enumeration
Compatible with IDEA StatiCa Beta 20.0
 Defines basic planes
 Namespace: IdeaRS.OpenModel.Geometry3D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public enum Plane
Public Enumeration Plane
Members
Member name | Value | Description
XY | 0 |  XY Plane - Plane normal to Z axis
YZ | 1 |  YZ Plane - Plane normal to X axis
ZX | 2 |  ZX Plane - Plane normal to Y axis
See Also
Reference
IdeaRS.OpenModel.Geometry3D Namespace